IDEmacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
* Header 
*Welcome To IDEmacs this custom configuration was created by Jachin Minyard in attempts to better understand Emacs, emacs-lisp and create an environment more along the lines of other IDE such as VS Code. Different aspects of the configuration are broken up into smaller sections below. Alot of the basis for my understanding of this material is due in part to the documentation but also the wonderful people over at !SystemCrafters! More features will continue to be added as I learn more about this enviroment. I hope you enjoy looking at my journey to master the Emacs environment*


* Package Management
Welcome to your first stop along the path to mastering Emacs configuration. There are many useful settings and configurations that come with Emacs by default, but in order to get the most out of it you should set up the package manager to make installing packages easier. The code in the following section seeks to do just that.

** Enable Packages
The following code segment enables package then adds several package directories to the package archives. This segment gives us access to packages from the following sites:

1. melpa
2. orgmode
3. elpa

Code:
#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "http://melpa.org/packages/")))

  (package-initialize)
#+end_src


** Initialize a New File 
The following segment is used to help initialize a new Emacs config file if none exist and no packages have been imported.

#+begin_src emacs-lisp
(unless package-archive-contents
  (package-refresh-contents))
#+end_src


** Use-Package
The following code segment is important as it allows for an easy way to configure packages you install by using the function *(use-package name)*. for more infromation on click here [[https://github.com/jwiegley/use-package/blob/master/README.md][(use-package)]].

*(setq use-package-always-ensure t)* is the equilivant to writing:

*(use-package name
       :ensure t)*

for all instances of *(use-package)*.

#+begin_src emacs-lisp
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src


* UI Config
Welcome to the UI Config section. In this section you will find various packages and settings to alter the overall appearance of Emacs. This ranges from cleaning up the basic GUI window. To Changing the fonts and color schemes this is where you will find it.

** Disable Start Up Message
The start up message that Emacs displays can become very clutersome and can be better to just turn off all together. set the following value to 'nil' of you want to see the message 't' to turn it off.

#+begin_src emacs-lisp
;;Disables the startup message
(setq inhibit-startup-message t)
#+end_src


** GUI Config
The code provided below is used to set the opening window of the GUI
Along with the font and size of the font.
*** GUI Dimensions
By default a lot of systems will launch Emacs in this tiny window and you have to resize it every time. this setting can configure the size of the starting window to be something more manageable. we are going to start with the option to start all frames that get opened infull screen mode for now. 

- Notes:
  - Frames are the same things as a window if you are unfimilar with some of this teminology. 
  - you may need to check your .emacs file to make sure that the change is made when swapping between the settigs.

*(if (window-system) (set-frame-size (desired frame) width height))*
Width is measured in chars and height is measured in lines.
*(add-to-list 'initial-frame-alist '(fullscreen . maximized))*
changinf the 'initial-frame-alist -> 'default-frame-alist, you can change if just the initial frame opens in fullscreen or if all frames open in full screen.
#+begin_src emacs-lisp
;; Allows you to customize the size and width to great precision and which frame to modify.
;; (selected-frame) can be changed to the desired frame.
;; the two parameters after the frame selection are height and width respectivly
;; width is in characters and height is in lines.  
;;(if (window-system) (set-frame-size (selected-frame) 124 40))

;; If you dont care about tweaking the height and width the following commands will work just fine
;; uncomment this line to start the initial frame maximized
;;(add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; uncomment this line to start every frame maximized
(add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

*** Text/Font
Code Will Set the Font and the font size. most people by default are used to font sizes like 12.0 13.0. this function takes font height as the size you want lets say 12.0 and accepts the parameter 12 * 100 = 120. Also keep in mind you may get an error when trying to set up the fonts as they might not be installed on your system. If that is the case just search the name of the font and how to install it. 

#+begin_src emacs-lisp
(set-face-attribute 'default nil :height 150)
;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height 150)
;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 170 :weight 'regular)
#+end_src

*** Line Numbers
In this section we will look at the line numbers on the left hand side of the screen and how to set it up globally and exclude modes where you do not what line numbers to appear.

**** Global Line Numbers

This code is increadibly simple. Enables line Numbers for all modes. Tho there are some modes where personaly I think the line numbers take away from the visual astetic of the mode *ie. org-mode*. So in the following section we will look at setting up an exclusion list tho there are some other implamentations that can be done here to avoid an exclusion list altogether.

This is the Global Line number code to turn the line numbers on everywhere.
#+begin_src emacs-lisp
;;Enables Global line numbers on the left side of the screen
(global-display-line-numbers-mode)
#+end_src

If you only want to turn line numbers on for spefic modes the following code will work better. This is just the reverse of what the code block for the exclusion block does and turns on line number mode for each of the following modes.
#+begin_src emacs-lisp
;; adds line numbers to the specified modes below. DO NOT USE IN CONJUNCTION WITH GLOBAL LINE MODE AND THE EXCLUSION LIST. pick one method or the other
;;(dolist (mode '(c-mode-hook
  ;;              c++-mode-hook
  ;;              java-mode-hook
  ;;              python-mode-hook))
  ;;(add-hook mode (lambda () (display-line-numbers-mode 1))))
#+end_src

**** Exclusion List for Line Numbers
This is the exclusion list if you chose to go with (global-display-line-numbers-mode) in the above section. If this is the case then you may find that some of the modes you come to work in do not need to have line numbers enabled. Personally I do not like the look of line numbers when I am working on my org documents so it has been turned off for that.

#+begin_src emacs-lisp
;;Creates Exclusion to remove certin modes from being effected by (global-display-line-numbers-mode)
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src


** Bar Modes
Welcome to Bar-Modes. This is one of the most basic features you can modify in the Emacs. All these options do are add additional GUI type features to the frames such as a scroll bar, menu bar, and tool bar. all features most GUI's have. Emacs gives you the ability turn these features on or off to give it a more sleek look. 

*** Tool-bar-mode
If you are new to Emacs and are not familiar with the basic key binds it is best to leave this one on. Enables the tool bar at the top of the GUI.. contains things like save, open, cut, paste...

#+begin_src emacs-lisp
;; Disables tool bar
(tool-bar-mode -1)
#+end_src

*** Menu-bar-mode
If you are new to Emacs and are not familiar with the basic key binds it is best to leave this one on. Enables the menu  bar at the top of the GUI.. contains things like Files, Tools, View,

#+begin_src emacs-lisp
;;Disables menu bar
(menu-bar-mode -1)
#+end_src

*** Scroll-bar-mode
This is one that is purely preference I turn the scroll bar off as it makes the screen less cluttered but leaving it on like everything in this document is purely optional based on the  users preference.

#+begin_src emacs-lisp
;;Disables scroll Bar
(scroll-bar-mode -1)
#+end_src


** Doom

*** Doom ModeLine
Description:
[[https://github.com/seagle0128/doom-modeline][Doom Modeline]]
Adds additional information to the Mode-Line and Provides and overhauled UI

This is our first look at an expanded version of the **(use-package)** function. Things to note are the **:init** section any code there will be run on initial start up. we place the command to enable doom Modeline there so it starts every time we open Emacs. There are many :Headers another one is **:custom** here we can place custom commands to edit the functionality of the package. there is also **:config**.  
#+begin_src emacs-lisp
(use-package doom-modeline
  :init
  (doom-modeline-mode 1)
  :custom
  ((doom-modeline-height 40)))
#+end_src

*** Doom Themes
Description:
[[https://github.com/doomemacs/themes][Doom Themes]]
Additional Color Schemes to add additional penalization to your config.

#+begin_src emacs-lisp
;;Installs the doom color themes
(use-package doom-themes)
#+end_src


** Color Themes
Everyone's favorite part the color theme! Change out the string 'doom-rouge to the theme of your choice. a full list of themes are listed below.

#+begin_src emacs-lisp
;;Sets the color theme
(load-theme 'doom-rouge t)
#+end_src

*** Default Themes
Themes that are installed with base Emacs.

**** Names
1. adwaita
2. deeper-blue
3. dichromacy
4. leuven
5. light-blue
6. manoj-dark
7. misterioso
8. tango
9. tango-dark
10. tsdh=dark
11. tsdh-light
12. wheatgrass
13. whiteboard
14. wombat

*** Doom Themes    
These are additional themes added by the [[https://github.com/doomemacs/themes/tree/screenshots][doom-themes]] package. Names of the themes listed below. (click the link to see screen shots)

**** Names
1. doom-1337
2. doom-Iosvkem
3. doom-acario-dark
4. doom-acario-light 
5. doom-ayu-dark 
6. doom-ayu-light 
7. doom-ayu-mirage 
8. doom-badger 
9. doom-bluloco-dark
10. doom-bluloco-light
11. doom-challenger-deep
12. doom-city-lights 
13. doom-dark+  
14. doom-dracula 
15. doom-earl-grey 
16. doom-ephemeral
17. doom-fairy-floss
18. doom-feather-dark
19. doom-feather-light
20. doom-flatwhite
21. doom-gruvbox-light
22. doom-gruvbox
23. doom-henna  
24. doom-homage-black 
25. doom-homage-white 
26. doom-horizon 
27. doom-ir-black 
28. doom-lantern 
29. doom-laserwave 
30. doom-manegarm 
31. doom-material-dark
32. doom-material
33. doom-meltbus 
34. doom-miramare
35. doom-molokai
36. doom-monokai-classic
37. doom-monokai-machine
38. doom-monokai-octagon 
39. doom-monokai-pro 
40. doom-monokai-ristretto
41. doom-monokai-spectrum 
42. doom-moonlight 
43. doom-nord-aurora 
44. doom-nord-light 
45. doom-nord 
46. doom-nova 
47. doom-oceanic-next
48. doom-oksolar-dark 
49. doom-oksolar-light
50. doom-old-hope 
51. doom-one-light
52. doom-one 
53. doom-opera-light
54. doom-opera 
55. doom-outrun-electric
56. doom-palenight 
57. doom-peacock 
58. doom-pine 
59. doom-plain-dark 
60. doom-plain 
61. doom-rouge 
62. doom-shades-of-purple 
63. doom-snazzy 
64. doom-solarized-dark-high-contrast
65. doom-solarized-dark
66. doom-solarized-light 
67. doom-sourcerer
68. doom-spacegrey 
69. doom-tokyo-night 
70. doom-tomorrow-day 
71. doom-tomorrow-nighte
72. doom-vibrant 
73. doom-wilmersdorf 
74. doom-xcode
75. doom-zenburn 

    
** Rainbow Delimiters
[[https://github.com/Fanael/rainbow-delimiters][Rainbow Delimiters]]
The following package is more of a utility package up since it changes the way delimiters appear in programming modes I decided to include it here. Rainbow Delimiters makes it so that matching delimiters will have the same color to make it easier to find matching parenthesis.

In this code block we get our first look at the **:hook** :header this allows you to set launch conditions for different packages based on the loading of a different package. In this code block we have **(prog-mode . rainbow-delimiters-mode)** this line state that if we are in a programming mode launch rainbow-delimiters-mode.
#+begin_src emacs-lisp
;;colors delimiters for easy matching
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))
#+end_src


* Org Mode
Welcome to [[https://orgmode.org/][Org Mode]]. This is one of the notable features about Emacs. While you can write org docs in other editors the full range of features is exclusive to Emacs. That being said lets dive into what org mode can do and the configuration required.

- This is where the code starts the become larger and more complicated in nature

