init.el
(require 'package)

(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("melpa" . "http://melpa.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

(require 'use-package)
(setq use-package-always-ensure t)

;;Disables the startup message
(setq inhibit-startup-message t)

;; Allows you to customize the size and width to great precision and which frame to modify.
;; (selected-frame) can be changed to the desired frame.
;; the two parameters after the frame selection are height and width respectivly
;; width is in characters and height is in lines.  
;;(if (window-system) (set-frame-size (selected-frame) 124 40))

;; If you dont care about tweaking the height and width the following commands will work just fine
;; uncomment this linestart the initial frame maximized
;;(add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; uncomment this line to start every frame maximized
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(set-face-attribute 'default nil :height 150)
;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height 150)
;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 170 :weight 'regular)

;;Enables Global line numbers on the left side of the screen
(global-display-line-numbers-mode)

;; adds line numbers to the specified modes below. DO NOT USE IN CONJUNCTION WITH GLOBAL LINE MODE AND THE EXCLUSION LIST. pick one method or the other
;;(dolist (mode '(c-mode-hook
  ;;              c++-mode-hook
  ;;              java-mode-hook
  ;;              python-mode-hook))
  ;;(add-hook mode (lambda () (display-line-numbers-mode 1))))

;;Creates Exclusion to remove certin modes from being effected by (global-display-line-numbers-mode)
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Disables tool bar
(tool-bar-mode -1)

;;Disables menu bar
(menu-bar-mode -1)

;;Disables scroll Bar
(scroll-bar-mode -1)

(use-package doom-modeline
  :init
  (doom-modeline-mode 1)
  :custom
  ((doom-modeline-height 40)))

;;Installs the doom color themes
(use-package doom-themes)

;;Sets the color theme
(load-theme 'doom-rouge t)

;;colors delimiters for easy matching
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))
