IDEmacs.org
** Font Configuration
First up lets look at seating up the text to be more pleasing when working on an org doc.

The following code snippet translates the base bullet point ' - ' and translates it into a nicer looking symbol in this case '•'. It also modifies the size of the headings based on the level in which it appears and makes sure that any features that require a fixed-face font are set to fixed-face. 

#+begin_src emacs-lisp
  (defun IDEmacs-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    ;;you can change the numerical value to change the size of the geading levels.
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-ofixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit '(fixed-pitch))
#+end_src



** Org Main Config
[[https://orgmode.org/manual/index.html][Org Mode Manual]] 
This is the main body of the code to set up Org mode. I tried to break up the configurations where I could. The user defined function *(defun IDEmacs-org-mode-setup)*  is where I placed all hooks and minor modes that I wished to launch along side org-mode. This includes an auto complete and a spell check. All additional configurations have been broken down into the features that they modify and been placed in user defined functions to make modifying your set up easier 

#+begin_src emacs-lisp
        (defun IDEmacs-org-mode-setup ()
          (org-indent-mode)
          (variable-pitch-mode 1)
          (visual-line-mode 1)
          (company-mode 1)
          (flyspell-mode 1))

        ;;Org-mode package and its built in configs
        (use-package org
          :hook 
          (org-mode . IDEmacs-org-mode-setup)
          (org-mode . IDEmacs-org-babel-tangle-config)
          :config
          (setq org-ellipsis " ")
          ;; User defined functions found below add to make the set up code look cleaner
          (IDEmacs-org-agenda-setup)
          (IDEmacs-org-custom-keywords)
          (IDEMacs-org-habits)
          (IDEmacs-org-task-refiling)
          (IDEmacs-org-capture-templates)
          (IDEmacs-font-setup))    
#+end_src

*** Custom Keywords
This User defined function sets up custom key word markers and tags that can be used through out org-mode and org-agenda.

#+begin_src emacs-lisp
(defun IDEmacs-org-custom-keywords ()
      (setq org-todo-keywords
            '((sequence "CURRENT(c)" " TODO(t)" "NEXT(n)" "|" "DONE(d!)")))

      ;;Creates a custom list of tags
      (setq org-tag-alist
            '((:startgroup)
              ;; Put mutually exclusive tags here
              (:endgroup)
              ("@errand" . ?E)
              ("@home" . ?H)
              ("@work" . ?W)
              ("agenda" . ?a)
              ("planning" . ?p)
              ("publish" . ?P)
              ("batch" . ?b)
              ("note" . ?n)
              ("idea" . ?i))))
#+end_src

*** Org Agenda 
set up for or-agenda. in this section we set up the path to specified file  or files that org-agenda will pull from as well as modifying the look of the log and the time before a task will show up on the agenda. Under all of that is some code to set up additional 

#+begin_src emacs-lisp
(defun IDEmacs-org-agenda-setup ()
      (setq org-agenda-files
            '("~/Documents/Projects/Code/Org-Mode/Schedule/Task.org")
            '("~/Documents/School/AssignmentSchedule.org"))
      (setq org-deadline-warning-days 7)
      (setq org-agenda-start-with-log-mode t)
      (setq org-log-done 'time)
      (setq org-log-into-drawer t)

      ;; Configure custom agenda views
      (setq org-agenda-custom-commands
            '(("d" "Dashboard"
               ((agenda "" ((org-deadline-warning-days 7)))
                (todo "NEXT"
                      ((org-agenda-overriding-header "Next Tasks")))
                (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
	    
              ("n" "Next Tasks"
               ((todo "NEXT"
                      ((org-agenda-overriding-header "Next Tasks")))))
	    
              ("W" "Work Tasks" tags-todo "+work-email")

              ;; Low-effort next actions
              ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
               ((org-agenda-overriding-header "Low Effort Tasks")
                (org-agenda-max-todos 20)
                (org-agenda-files org-agenda-files))))))
#+end_src

*** Habit mode
Habit mode allows for additional task tracking 

#+begin_src emacs-lisp
  ;;Enables habit mode
  (defun IDEMacs-org-habits ()
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60))
#+end_src

*** Refiling
allows the moving of completed task to an archive file to keep your task folder clean emacs will then save after a refiling.

#+begin_src emacs-lisp
  ;;Allows you to move completed task from the task file to the archive file
  (defun IDEmacs-org-task-refiling ()
    (setq org-refile-targets
          '(("Archive.org" :maxlevel . 1)
            ("Tasks.org" :maxlevel . 1)))
  
    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers))

#+end_src

*** Capture templates
allows the binding of keys to allow quick access of files to do things like add a task, take a note, or look at some other code at a glance.

#+begin_src emacs-lisp
  (defun IDEmacs-org-capture-templates ()
    (setq org-capture-templates
          `(("t" "Tasks / Projects")
            ("tt" "Task" entry (file+olp "~/Documents/Projects/Code/Org-Mode/Schedule/Task.org" "Inbox")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

            ("j" "Journal Entries")
            ("jj" "Journal" entry
             (file+olp+datetree "~/Documents/Projects/Code/Org-Mode/Schedule/Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)
            ("jm" "Meeting" entry
             (file+olp+datetree "~/Documents/Projects/Code/Org-Mode/Schedule/Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

            ("w" "Workflows")
            ("we" "Checking Email" entry (file+olp+datetree "~/Documents/Projects/Code/Org-Mode/Schedule/Journal.org")
             "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1))))
#+end_src



** Heading Bullets  
Having * ** *** **** in your headings can become rather busy to look at to fix this problem we can use the package org-bullets this gives each level a unique symbol which you can then modify to your liking.

gets org-bullets and launches it anytime we enter org-mode. we then set the bullets to a custom list to keep a theme running in our files instead of letting the package auto assign symbols. If you wanna see what symbols the package will do natural remove the lines following *:custom*.
#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src




** Center Org Mode Buffers
Welcome to More formatting of text *YAY!*.  No for real tho in this section we have code that centers the org buffer on screen to make it closer to other document editorrs most people are familiar with. For more infromation on visual-fill-column click [[https://github.com/joostkremers/visual-fill-column][here]].

The following code block sets the size of the "margins", enables the centering of text, and enables column fill mode.
*(setq visual-fill-column-width VALUE)*
VALUE: set to an _number_ to change the width of the margins. I find the sweet spot for my devices is anywhere from 80-150. The Value is how many chars from the center you wish to start the text.
 *(visual-fill-column-center-text t)*
Should we center the test on the center column (_t or nil_)
*(visual-fill-column-mode 1)*
enables visual column-mode must set value to 1 _AND_ run in conjunction with *(visual-fill-column-center-text t)* to get text to center.
#+begin_src emacs-lisp
  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))
#+end_src



** Configure Babel Languages
[[https://orgmode.org/worg/org-contrib/babel/][org-babel]] allows for some awesome functionality with code blocks in org docs such as being able to evaluate and display the results of the code or writing the code to a separate source file as you develop. such as this file does with your Emacs config 

For more infromation on babel languages click [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][here]]
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (C . t)
     (java .t)))
#+end_src



