IDEmacs.org
** Auto-tangle Configuration Files:
The point of this code is to let this file Auto-tangle with the .Emacs file. What this means is that this file when you save, it should automatically out-put the code blocks to the file specified in the header at the top of this file. For more infromation on tangle click [[https://orgmode.org/manual/Extracting-Source-Code.html][here]]

The following block defines a user function to run the tangle command after the buffer is saved. Every time we eval code to output it to the file named in the header of this file org-babel will ask if it is okay to eval this becomes a pain very quickly for large files so to turn this off we set *(org-confirm-babel-evaluate)* to nil.
#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun IDEmacs-org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
    (expand-file-name "~/Documents/Projects/Code/Org-Mode/IDEmacs/IDEmacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'IDEmacs-org-babel-tangle-config)))
#+end_src



** Org Templates 
[[https://github.com/dangom/org-mode/blob/master/lisp/org-tempo.el][Org Tempo]] is a add on to org mode that extends the functionality of templates for code blocks. Below we set up a few templates to make inserting code blocks easier. to insert a code block for one of the languages below is simply type "<name" ie. "<el Tab" will insert a code block for emacs 

#+begin_src emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("j" . "src java"))
#+end_src


* Which Key
Which key is a helpful feature for all users but especially new users as it gives you a way to see what the options are for hot keys as you start typing the. Simply start the key bind sequence and scan the results to find the function. ie. type "C-c " this will pull up a mini window with the possible completions. 

#+begin_src emacs-lisp
  (use-package which-key
    :init
    (which-key-mode)
    :diminish
    which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src


* Spelling and Error Checking
Welcome to our Spelling and Error Checking for code and text file. This section will have a few different packages to help people who are new to development and are not sure of what functions they can use or what exactly the name of a header file is don't worry I have been there too.

** Flycheck
Welcome to [[https://www.flycheck.org/en/latest/][Flycheck]]! Flycheck is an Emacs package for on the fly syntax checking. This package combined with others can help make Emacs feel more like a complete IDE. Like any feature tho there maybe places where you prefer to have the feature turned off. to save you the hassle of having to turn off Flycheck manually just add the mode you wish to exclude to the Flycheck Exclusion List 

The following code block uses the package flycheck and the runs it anytime a program-mode is detected
#+begin_src emacs-lisp
  (use-package flycheck
    :hook
    (prog-mode . flycheck-mode))
#+end_src

*** Flycheck Exclusion List
Hopefully if you have been reading through this document the following code block should be familiar to you. just any modes to the mode '( ) that you wish to exclude from running Flycheck. 
#+begin_src emacs-lisp
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  emacs-lisp-mode-hook))
    (add-hook mode (lambda () (flycheck-mode 0))))
#+end_src


** Company
Welcome to  [[http://company-mode.github.io/][Company]] Mode. Company is a package that allows for auto completions as you work. This is a hand tool to have on as a newbie to a language as it can prompt you with options to help you ember functions you might have other wise forgot.
*** Company Mode
Company mode is a auto complete package for Emacs I use company mainly inside of programming languages to help me remember the full name of functions or other language specific features.

This code block enables company mode for all programming modes, org-mode as well,  and sets a few additional setting to make the experience of company more responsive.  *company-set-idle-delay* determines the time before the suggestions pop on screen. Where *company-minimum-prefix-length* determines the amount of chars you need before suggestions will appear on screen. 
#+begin_src emacs-lisp
  (use-package company
    :hook
    (prog-mode . company-mode)
    (org-mode . company-mode)
    :config
    (setq company-idle-delay 0.1)  
    (setq company-minimum-prefix-length 1))
#+end_src

*** Company Box Mode
 [[https://github.com/sebastiencs/company-box][Company-Box]] mode is an extension on Company-mode. This extension adds to addition functionality as well as cleans up the UI of the suggestions.

The hook in this code makes sure that if Emacs goes into Company-mode that company-box-mode will also launch.
#+begin_src emacs-lisp
(use-package company-box
  :hook
  (company-mode . company-box-mode))
#+end_src

*** Company Exclusion List
Hopefully if you have been reading through this document the following code block should be familiar to you. just any modes to the mode '( ) that you wish to exclude from running Company. I use company for most modes so for me this will be empty.

#+begin_src emacs-lisp
  ;;(dolist (mode '())
    ;;(add-hook mode (lambda () (company-mode 0))))
#+end_src


* Development
The Development section has packages that relate to the easy of use and work flow of coding projects that you might find useful. Projectile is a project manager, Magit is a git companion and Treemacs is a file display tree for easy project navigation.

** Treemacs
[[https://github.com/Alexander-Miller/treemacs][Treemacs]] is a file display system similar to something found in vs code. This is installed as a dependency of lsp-treemacs and all of its features. This package has some nice functionality and a large amount of customization's.

#+begin_src emacs-lisp
  (use-package treemacs
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (treemacs-git-mode 'extended)
    (setq treemacs-width 20)
    (setq treemacs-indention 3)
    :bind
    ;; global map to pull up the currently displayed project.
    (:map global-map
          ("C-c q" . treemacs)))

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

#+end_src


** Projectile
[[https://docs.projectile.mx/projectile/index.html][Projectile]] is a local project manager. Determines if files in a directory are in a project such as directories that contain a .git or a .projectile. if it detects on of these files additional functionally becomes available such as replacing an instance of something across the whole project or jumping to files anywhere in the project directory.

The following code block dosent do much to change the base functionality of projectile we change the key binds to access projectile commands, define which auto complete to use and provide a path to where we store our git repositories. 

#+begin_src emacs-lisp
(use-package projectile
  :diminish
  projectile-mode
  :config
  ;; Turns on global projectile
  (projectile-mode)
  :custom
  ((projectile-completion-system 'company))
  :bind-keymap
  ;; Sets C-c p to open projectile commands
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Documents/Projects/Code")
    (setq projectile-project-search-path '("~/Documents/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))
#+end_src


** Magit
 [[https://magit.vc/][Magit]] is a git companion. I have not made any customization's to this package and just use it at base. A quick run down of some of the commands first of open the magit buffer with "C-x g" This will open a new buffer with an over view of your current project now here's the kicker type h and it will give you a list of commands available. In the buffer some basic info such as staged and unstaged changes and recent commits should be shown. Some of these sections are collapsible this can be done with Tab. if you cursor over an unstaged file and type "s" you will stage that file. to unstage one select it and type "u". You can open the commit options by typing "c", and pushes can be done with "p". for more info on what is available check the documentation linked above.

#+begin_src emacs-lisp
(use-package magit)
#+end_src


** Lsp Mode
Welcome to the [[https://github.com/emacs-lsp/lsp-mode][lsp]] section. Lsp is a language server protocol that allows your editor access to a languages syntax such as java or c/c++. This package allows Emacs to have a more IDE like feel with error highlighting and info Boxes for different parts of the language.

*** Lsp Mode
The following section is the basic package for lsp-mode and some simple hook statements to help run it when a compatible program-mode is detected.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands
    (lsp lsp-deferred)
    :hook
    (c-mode . lsp-mode)
    (c++-mode . lsp-mode)
    (python-mode . lsp-mode)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))
#+end_src


*** Lsp UI
lsp-ui adds additional features to the lsp library to allow for better customization's of lsp-mode. Note that all you need to do at base is call **(use-package)** lsp-ui.

#+begin_src emacs-lisp
  (use-package lsp-ui)
#+end_src


*** Lsp  Treemacs
Adds a unique file display tree for lsp-mode.

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp
    :config
    (lsp-treemacs-sync-mode 1)
    (setq lsp-treemacs-width 20)
    :bind 
    (:map global-map ("C-c t" . lsp-treemacs-symbols)))
#+end_src


*** Lsp Java
What is currently missing from using lsp-java mode.
#+begin_src emacs-lisp
(use-package lsp-java :config (add-hook 'java-mode-hook 'lsp))
(use-package helm-lsp)
(use-package helm
  :config (helm-mode))
#+end_src


** Dap
Dap is a debugger.

#+begin_src emacs-lisp
(use-package dap-mode :after lsp-mode :config (dap-auto-configure-mode))
(use-package dap-java :ensure nil)
#+end_src


* Key Bindings

** General Key-Binds

#+begin_src emacs-lisp
;;This is a useful keybind that allows ESC to exit out of prompts.
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src


** Projectile Key-Binds


** Org-Mode Key-Binds

#+begin_src emacs-lisp
  ;; Sets up Unique keybinds for Org-Mode  
  ;; Add entry to your journal
  (define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj")))
  ;; set a todo task
  (define-key global-map (kbd "C-c l")
    (lambda () (interactive) (org-capture nil "tt")))
  ;; Open the Agenda.    
  (define-key global-map (kbd "C-c a")
    (lambda () (interactive) (org-agenda-list "a")))
#+end_src
