init.el

;; Automatically tangle our Emacs.org config file when we save it
(defun IDEmacs-org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
  (expand-file-name "~/Documents/Projects/Code/Org-Mode/IDEmacs/IDEmacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'IDEmacs-org-babel-tangle-config)))

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("j" . "src java"))

(use-package which-key
  :init
  (which-key-mode)
  :diminish
  which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package flycheck
  :hook
  (prog-mode . flycheck-mode))

(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook
                emacs-lisp-mode-hook))
  (add-hook mode (lambda () (flycheck-mode 0))))

(use-package company
  :hook
  (prog-mode . company-mode)
  (org-mode . company-mode)
  :config
  (setq company-idle-delay 0.1)  
  (setq company-minimum-prefix-length 1))

(use-package company-box
  :hook
  (company-mode . company-box-mode))

;;(dolist (mode '())
  ;;(add-hook mode (lambda () (company-mode 0))))

(use-package treemacs
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (treemacs-git-mode 'extended)
  (setq treemacs-width 20)
  (setq treemacs-indention 3)
  :bind
  ;; global map to pull up the currently displayed project.
  (:map global-map
        ("C-c q" . treemacs)))

(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)

(use-package projectile
  :diminish
  projectile-mode
  :config
  ;; Turns on global projectile
  (projectile-mode)
  :custom
  ((projectile-completion-system 'company))
  :bind-keymap
  ;; Sets C-c p to open projectile commands
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Documents/Projects/Code")
    (setq projectile-project-search-path '("~/Documents/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package magit)

(use-package lsp-mode
  :commands
  (lsp lsp-deferred)
  :hook
  (c-mode . lsp-mode)
  (c++-mode . lsp-mode)
  (python-mode . lsp-mode)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui)

(use-package lsp-treemacs
:after lsp
:config
(lsp-treemacs-sync-mode 1)
(setq lsp-treemacs-width 20)
:bind (:map global-map ("C-c t" . lsp-treemacs-symbols)))

(use-package lsp-java :config (add-hook 'java-mode-hook 'lsp))
(use-package helm-lsp)
(use-package helm
  :config (helm-mode))

(use-package dap-mode :after lsp-mode :config (dap-auto-configure-mode))
(use-package dap-java :ensure nil)

;;This is a useful keybind that allows ESC to exit out of prompts.
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Sets up Unique keybinds for Org-Mode  
(define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj")))
(define-key global-map (kbd "C-c l")
    (lambda () (interactive) (org-capture nil "tt")))
(define-key global-map (kbd "C-c a")
  (lambda () (interactive) (org-agenda-list "a")))
